# tools
brew "bat"
brew "chezmoi"
brew "cosign"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "mise"
brew "neovim"
brew "pgcli"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tealdeer"
brew "viddy"
brew "yazi"
brew "yq"
brew "yt-dlp"

# git
brew "delta"
brew "gh"
brew "lazygit"
