# tools
brew "bat"
brew "chezmoi"
brew "cosign"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "jq"
brew "mise"
brew "neovim"
brew "pgcli"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tealdeer"
brew "topgrade"
brew "tree-sitter-cli"
brew "uv"
brew "viddy"
brew "wakeonlan"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"

# git
brew "delta"
brew "gh"
brew "lazygit"

# container
brew "hadolint"

# md
brew "rumdl"

# sh
brew "shellcheck"
brew "shfmt"

# yaml
brew "yamlfmt"
brew "yamllint"

# lua
brew "stylua"

# k8s
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
brew "helm"
brew "krew"
brew "kubecolor"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "stern"

# go
brew "go"
brew "gofumpt"
brew "goimports"
brew "golangci-lint"

# nodejs
brew "biome"
brew "node"

# java
brew "gradle"
brew "openjdk"

# wezterm
tap "wezterm/wezterm-linuxbrew"
brew "wezterm/wezterm-linuxbrew/wezterm"
