# tools
brew "atuin"
brew "bat"
brew "chezmoi"
brew "cosign"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "jq"
brew "mise"
brew "neovim"
brew "pastel"
brew "pgcli"
brew "resvg"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tealdeer"
brew "topgrade"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "viddy"
brew "wakeonlan"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"

# git
brew "delta"
brew "gh"
brew "git-credential-oauth"
brew "lazygit"

# containerfile
brew "dockerfile-language-server"
brew "hadolint"

# md
brew "ltex-ls-plus"
brew "rumdl"

# sh
brew "bash-language-server"
brew "shellcheck"
brew "shfmt"

# yaml
brew "yaml-language-server"
brew "yamlfmt"
brew "yamllint"

# lua
brew "lua-language-server"
brew "stylua"

# k8s
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
brew "helm"
brew "krew"
brew "kubecolor"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "stern"

# go
brew "delve"
brew "go"
brew "gofumpt"
brew "goimports"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "gopls"
brew "templ"

# nodejs
brew "biome"
brew "node"

# java
brew "gradle"
brew "openjdk"

# rust
brew "bacon"
brew "bacon-ls"
brew "rust-analyzer"

# other
brew "pkl-lsp"
brew "taplo"
brew "vscode-langservers-extracted"

# casks
cask "font-jetbrains-mono-nerd-font"
